Дипломный_проект/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерПочасовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломный_проект/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ВКМ_Календарь</schedule>
  <scheduleValue>InformationRegister.ВКМ_Календарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_Календарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПочасовой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Дипломный_проект/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дипломный_проект/src/Documents/ВКМ_НачислениеЗарплаты/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения(); 
	РассчитатьОсновныеДвижения();
	
КонецПроцедуры  

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
	Движения.ВКМ_ОсновныеНачисления.Очистить();
	
	Для Каждого Строка Из СписокСотрудников Цикл
				
		Движение                      = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации    = Дата; 
		Движение.ВидРасчета           = Строка.ТипРасчета;
		Движение.ПериодДействияНачало = ДатаНачала; 
		Движение.ПериодДействияКонец  = ДатаОкончания;
		Движение.Сотрудник            = Строка.Сотрудник;
		Движение.Размер               = Строка.Размер; 		
		Движение.РазмерПочасовой      = Строка.РазмерПочасовой;
				
	КонецЦикла;  
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры 

Процедура РассчитатьОсновныеДвижения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия КАК Факт,
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньПериодДействия КАК План
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
				             
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		//Регистр ВКМ_ОсновныеНачисления
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		
		ПланОкладНДФЛ = Движение.Размер * 0.87;
		
		Если Выборка.План = Выборка.Факт Тогда
			
			ФактОкладНДФЛ = ПланОкладНДФЛ;
			 
		Иначе
			
			ФактОкладНДФЛ = ПланОкладНДФЛ * (Выборка.Факт / Выборка.План);	
			
		КонецЕсли;
			
		ПочасоваяНДФЛ = Движение.РазмерПочасовой * 0.87;
       
		ИтоговаяНДФЛ = ФактОкладНДФЛ + ПочасоваяНДФЛ;

		Движение.Результат = ИтоговаяНДФЛ; 
				
		//Регистр ВКМ_ВзаиморасчетыССотрудниками
		
		ДвижениеВзаиморасчетыССотрудниками = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		
		ДвижениеВзаиморасчетыССотрудниками.Период = Дата;
		ДвижениеВзаиморасчетыССотрудниками.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчетыССотрудниками.Сотрудник = Движение.Сотрудник;  
		ДвижениеВзаиморасчетыССотрудниками.Сумма = ИтоговаяНДФЛ;
				
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры    

#КонецОбласти
